app/views/users/show.html.erb

    <%= render 'follow_form' if current_user %>
    <% if @user.posts.any? %>
      <h3>Posts (<%= @user.posts.count %>)</h3>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]