app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC, created_At DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "yeye"], ["created_at", "2019-04-15 19:56:56.752289"], ["updated_at", "2019-04-15 19:56:56.752289"]]
---
  def create
    @post = Post.new(post_params)

      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "yeye\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n."], ["updated_at", "2019-04-15 19:57:39.821999"], ["id", 4]]
---
  def update
    Post.find_by(id:params[:post_id])
    if @post.update(post_params)