app/controllers/users_controller.rb

  def show
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC

  def create
    @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$Nz27LeBU91abZ3qUNSy7P.KOzLDx4PDrS5LXWUTM6YCG.E2MJ5hzm"], ["updated_at", "2019-04-15 19:08:51.901070"], ["id", 1]]